; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 7620)
	(= (fuel plane1) 116)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 9)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 1)
	(at person1 city6)
	(at person2 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 690)
	(= (distance city0 city2) 674)
	(= (distance city0 city3) 936)
	(= (distance city0 city4) 999)
	(= (distance city0 city5) 799)
	(= (distance city0 city6) 961)
	(= (distance city0 city7) 733)
	(= (distance city1 city0) 690)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 545)
	(= (distance city1 city3) 732)
	(= (distance city1 city4) 756)
	(= (distance city1 city5) 902)
	(= (distance city1 city6) 895)
	(= (distance city1 city7) 703)
	(= (distance city2 city0) 674)
	(= (distance city2 city1) 545)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 910)
	(= (distance city2 city4) 576)
	(= (distance city2 city5) 999)
	(= (distance city2 city6) 743)
	(= (distance city2 city7) 730)
	(= (distance city3 city0) 936)
	(= (distance city3 city1) 732)
	(= (distance city3 city2) 910)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 699)
	(= (distance city3 city5) 632)
	(= (distance city3 city6) 770)
	(= (distance city3 city7) 693)
	(= (distance city4 city0) 999)
	(= (distance city4 city1) 756)
	(= (distance city4 city2) 576)
	(= (distance city4 city3) 699)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 614)
	(= (distance city4 city6) 892)
	(= (distance city4 city7) 594)
	(= (distance city5 city0) 799)
	(= (distance city5 city1) 902)
	(= (distance city5 city2) 999)
	(= (distance city5 city3) 632)
	(= (distance city5 city4) 614)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 584)
	(= (distance city5 city7) 980)
	(= (distance city6 city0) 961)
	(= (distance city6 city1) 895)
	(= (distance city6 city2) 743)
	(= (distance city6 city3) 770)
	(= (distance city6 city4) 892)
	(= (distance city6 city5) 584)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 723)
	(= (distance city7 city0) 733)
	(= (distance city7 city1) 703)
	(= (distance city7 city2) 730)
	(= (distance city7 city3) 693)
	(= (distance city7 city4) 594)
	(= (distance city7 city5) 980)
	(= (distance city7 city6) 723)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city5)
	(at person1 city4)
	(at person2 city7)
	))

(:metric minimize (+ (* 5 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (refuel plane1 city1)
   changed: (fuel plane1) from 116 to 7620
   goals met: 0 of 3
2. (fly plane1 city1 city6)
   deleted: (at plane1 city1)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 0 to 2685, (fuel plane1) from 7620 to 4935
   goals met: 0 of 3
3. (board person1 plane1 city6)
   deleted: (at person1 city6)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 3
4. (fly plane1 city6 city4)
   deleted: (at plane1 city6)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 2685 to 5361, (fuel plane1) from 4935 to 2259
   goals met: 0 of 3
5. (debark person1 plane1 city4)
   deleted: (in person1 plane1)
   added: (at person1 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 1 of 3
6. (board person2 plane1 city4)
   deleted: (at person2 city4)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 3
7. (fly plane1 city4 city5)
   deleted: (at plane1 city4)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 5361 to 7203, (fuel plane1) from 2259 to 417
   goals met: 2 of 3
8. (refuel plane1 city5)
   changed: (fuel plane1) from 417 to 7620
   goals met: 2 of 3
9. (fly plane1 city5 city7)
   deleted: (at plane1 city5)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 7203 to 10143, (fuel plane1) from 7620 to 4680
   goals met: 1 of 3
10. (debark person2 plane1 city7)
   deleted: (in person2 plane1)
   added: (at person2 city7)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 3
11. (fly plane1 city7 city5)
   deleted: (at plane1 city7)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 10143 to 13083, (fuel plane1) from 4680 to 1740
   goals met: 3 of 3
